tap "hashicorp/tap"
tap "sdkman/tap"
brew "openssl@3"
brew "python@3.13"
brew "awscli"
brew "azure-cli"
brew "bash-completion@2"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "docker"
brew "elixir"
brew "gh"
brew "git"
brew "jq"
brew "go"
brew "k9s"
brew "openjdk"
brew "kafka"
brew "kcat"
brew "kubernetes-cli"
brew "kubectx"
brew "maven"
brew "maven-completion"
brew "mysql@8.0"
brew "node"
brew "nvm"
brew "pipx"
brew "ruby"
brew "swagger-codegen"
brew "tomcat@8"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-completions"
brew "hashicorp/tap/vault"
cask "claude-code"
cask "codex"
cask "datagrip"
cask "dbeaver-community"
cask "intellij-idea"
cask "iterm2"
cask "jetbrains-toolbox"
cask "slack"
vscode "adpyke.vscode-sql-formatter"
vscode "alexkrechik.cucumberautocomplete"
vscode "andys8.jest-snippets"
vscode "angular.ng-template"
vscode "azemoh.one-monokai"
vscode "azemoh.theme-onedark"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "helgardrichard.helium-icon-theme"
vscode "iampeterbanjo.elixirlinter"
vscode "jakebecker.elixir-ls"
vscode "johnpapa.angular2"
vscode "kevinrose.vsc-python-indent"
vscode "marnix.peacock"
vscode "mblode.twig-language"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikael.angular-beastcode"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "vincaslt.highlight-matching-tag"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "whatwedo.twig"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
